package level3.lesson3.part2;

/*
    Создать класс Человек, Танцор, Певец, Доктор. У класса Человек есть метод зарабатывать деньги,
     в нём выводить “работаю на обычной работе”. Классы Танцор, Певец и Доктор наследуют класс
     Человек и переопределяют метод зарабатывать деньги, каждый переопределяет метод по своему,
      написать свою реализацию, например для доктора вывод на экран “Лечу людей, помогаю быть
      здоровыми”. В методе main создать массив с типом Человек, туда записать несколько объектов
       разных типов Человека. Пройтись по массиву через цикл вызвать у каждого объекта метод
       зарабатывания денег.
*/
public class Task3 {
}
