package level1.lesson3.part1;

public class TaskShopping {
    public static void main(String[] args) {
//        З-ча с  if:
//        создать класс
//        создать переменную money, записать туда любое значение от 100 до 1000.
//        использовать “if” и добавить проверку, если количество денег меньше 200,
//        то вывести на экран “Осторожно деньги заканчиваются.”
//        в любом случае в конце программы должен быть вывод “Я иду в магазин”.
        int money = 200;
        if (money < 200) {
            System.out.println("Осторожно деньги заканчиваются.");
        }
        System.out.println("Я иду в магазин");


    }
}
