package level3.lesson1.part2;

/*
    Создайте класс Error, определите в нем три поля: boolean isActive, int statusCode,
    String message. Добавьте в этом классе 2 конструктора: конструктор по умолчанию,
    конструктор с тремя параметрами, который будет инициализировать поля переданными значениями.
     Создайте метод printInfo, который выводит в консоль содержимое полей. Добавьте метод main(),
      в котором будете создавать объект с помощью конструктора по умолчанию, а также несколько
      объектов с помощью конструктора с параметрами. Вызовите на созданных объектах метод
      printInfo.
*/
public class Task {
    public static void main(String[] args) {
    }
}
